/*==========================================================*/ 	
/* Title		:	InverterAlgorithm.h								*/ 	
/* Description	: 	Class_InverterAlgorithm definition				*/ 	
/* Date			:	Apr.2008								*/ 	
/*==========================================================*/
#ifndef		INVERTERALGORITHM_H
       
#define     INVERTERALGORITHM_H

//优化锁锁相环锁相算法参数
const 	INT16	KpBpPLLCnst	= 200;							//2*360*65536/fpwm=0x170A
const 	INT16	KiBpPLLCnst	= 1;							//48*360*65536/fpwm/60=0x0937
const 	INT16	K0BpPLLCnst	= (KpBpPLLCnst+KiBpPLLCnst);
const 	INT16	K1BpPLLCnst	= KpBpPLLCnst;
const	INT32	KDthetaInvSyncBaseCnst = 768000000;			//360*1024*10^8/(4*fpwm)
																//Dtheta=360*1024/点数
																//点数=fpwm/(1/(k*10e-8))=cnt*fpwm*10e-8
																//Dtheta=360*1024*10^8/fpwm/cnt
																//K=360*1024*10^8/fpwm/4=1152000000

const	INT32	Theta90Cnt = 5898240;							//90*65536=5898240
const	INT32	Theta180Cnt = 11796480;
const	INT32	Theta270Cnt = 17694720;
const	INT32	Theta360Cnt = 23592960;
const	INT16	InvSyncPrd40HzDiv2 = 3906;						//3906*2*32*10*10ns=25ms
const	INT16	InvSyncPrd50HzDiv2 = 3125;						//3125*2*32*10*10ns=20ms
const	INT16	InvSyncPrd60HzDiv2 = 2604;						//2604*2*32*10*10ns=16.67ms
const	INT16	InvSyncPrd70HzDiv2 = 2232;						//2232*2*32*10*10ns=14.28ms

const	INT32	InvSyncCap45HzCnt = 2222222;					//45Hz	1/45/10e-8=2222222
const	INT32	InvSyncCap66HzCnt = 1515152;					//66Hz	1/66/10e-8=1515152
const	INT32	InvSyncCap45HzCntDiv2 = 1111111;

const	INT16   KSPWMCnst1 = 1132;								//220*2083/405=1132                                                                                                                                                                                                                                                              
const	INT16   KSPWMCnst2 = 1183;								//230*2083/405=1183                                                                                                                                                                                                                                                              
const	INT16   KSPWMCnst3 = 1234;								//240*2083/405=1234                                                                                                                                                                                                                                                              
                                                                                                                                                                                                                                                                                                                                                                                 
		struct	structIntMainFlag
		{	
			UINT16	bVpwmCrossZero			:1;					//BIT00		调制波过零   		0不过零 1过零			
			UINT16	bVoutAbnormal			:1;					//BIT01		输出电压异常标志	0正常	1异常			
			UINT16	bBpSTSShortLatch		:1;					//BIT02		旁路晶闸管短路标志（中断瞬时值判据）0正常1短路			
			UINT16	bVoutdiffFast			:1;					//BIT03		输出压差快速检测异常标志			0正常1异常			
			UINT16	bVoutFastA				:1;					//BIT04		输出A相电压快速检测标志				0正常1异常			
			UINT16	bVoutFastB				:1;					//BIT05		输出B相电压快速检测标志				0正常1异常			
			UINT16	bVoutFastC				:1;					//BIT06		输出C相电压快速检测标志				0正常1异常			
			UINT16	bVinvLoadFast			:1;					//BIT07		逆变带冲击载异常标志				0正常1异常			
			UINT16	bPhaseLock				:1;					//BIT08		相位锁定标志						0无	1相位锁定			
			UINT16	bVbpFastChk				:1;					//BIT09		旁路快速检测进行中，中断专用		0无	1进行中			
			UINT16	bVinvFastChk			:1;					//BIT10		逆变快速检测进行中，中断专用		0无	1进行中			
			UINT16	bSinPositive			:1;					//BIT11		保留
			UINT16	bVinvFast				:1;					//BIT12		逆变各相电压快速检测标志			0正常1异常			
			UINT16	bVbpFast				:1;					//BIT13		旁路各相电压快速检测标志			0正常1异常			
			UINT16	bVinvKMFast				:1;					//BIT14						
			UINT16	bCANMaster				:1;					//BIT15		CAN通讯主从机标志					0-通讯从机1-通讯主机			
		};
	
		struct	structIntMainFlag1
		{	
			UINT16	bVinvLoadFastA			:1;					//BIT01		逆变A相带载异常标志（用于逆变器故障）0正常1异常			
			UINT16	bVinvLoadFastB			:1;					//BIT01		逆变B相带载异常标志（用于逆变器故障）0正常1异常			
			UINT16	bVinvLoadFastC			:1;					//BIT02		逆变C相带载异常标志（用于逆变器故障）0正常1异常			
			UINT16	bDcOvPluseOff			:1;					//BIT03		置母线过压封脉冲标志（原：正母线过压封脉冲标志）0正常1异常			
			UINT16	bLowSyncPositive		:1;					//BIT04		工频同步过零信号			
			UINT16	bDcOvTotal				:1;					//BIT05		母线过压总标志（当前信号）			0正常1异常			
			UINT16	bDcOvPluseOffDoing		:1;					//BIT06		母线脉冲封锁进行中标志				0正常1异常			
			UINT16	bBpPhaseLock			:1;					//BIT07		主机对旁路的锁定状况				0未锁定1锁定								
			UINT16	bSlaverPhaseLock		:1;					//BIT08		从机的锁定状况						0未锁定1锁定
			UINT16	binvKMtime				:1;					//BIT09		0继电器已闭合时间小于400ms 1继电器已闭合时间大于400ms
            UINT16	bRev					:1;					//BIT10				保留		
            UINT16	bBpInvOverCurrentReason :1;					//BIT11		用于快检主旁共通时，标记是逆变接触器短路引起还是旁路晶闸管引起
             													// 1:	逆变接触器短路引
             													//0:		旁路晶闸管引起
			UINT16	bDcOvTotalBak			:1;					//BIT12		母线过压总标志（备份信号）						
			UINT16	bBpInvOverCurrent		:1;					//BIT13	快检  主旁共通标志			 	
            UINT16    bBpSTSShort           :1;                                   //BIT14  旁路SCR短路 200ms确认后, 有寄存
			UINT16	bVoutFastChkAbnomal		:1;					//BIT15	VoutFastChkAbnomal					

		};

		struct	structIntMainFlag2
		{
			UINT16	bBptoInvZero				:1;
			UINT16	bWaitingZeroCrossDelayok	:1;
			UINT16	bBpSTSShortPulseDoing		:1;
			UINT16 	bRev0315					:13;
		};

	class Class_InverterAlgorithm
	{
	public:
		
		volatile struct		structIntMainFlag		m_st_wIntMainFlag;				//中断至主程序标志
		volatile struct		structIntMainFlag1		m_st_wIntMainFlag1_0;			//中断至主程序标志1
		volatile	struct	structIntMainFlag2		m_st_wIntMainFlag2_0;
		INT16		m_i16ThetaStepBp_0;	
		INT16		m_i16TinvUsSumM_0;

		INT16		m_i16wVrefRunMd_0;								//电压给定矢量d轴分量
		INT16		m_i16wVrefActMd_0;
		INT16		m_i16VrefActMz_0;
		INT16		m_i16KSPWM;										//SPWM发波控制系?

		UINT32		m_u32TLowSyncClk_0;
		UINT32		m_u32TLowSyncClkOld_0;
		UINT32		m_u32TLowSync;
		INT16		m_i16wIinvMdFilterAvg_0;							//模块CAN通讯传输的D轴电流滤波值的平均值
		INT16		m_i16wIinvMqFilterAvg_0;							//模块CAN通讯传输的Q轴电流滤波值的平均值
		INT16		m_i16wIinvMzFilterAvg_0;							//模块CAN通讯传输的Z轴电流滤波值的平均值
		INT16		m_i16wIinvMdFilter_0;							//本机在CAN通讯上传输的D轴电流滤波值
		INT16		m_i16wIinvMqFilter_0;							//本机在CAN通讯上传输的Q轴电流滤波值
		INT16		m_i16wIinvMzFilter_0;							//本机在CAN通讯上传输的Z轴电流滤波值

		 
		
		INT16		m_i16VdcaCon_0;									//A相逆变电压直流分量控制量
		INT16		m_i16VdcbCon_0;									//B相逆变电压直流分量控制量
		INT16		m_i16VdccCon_0;									//C相逆变电压直流分量控制量

		
		 UNLONG		m_unVinvaDcFilter_0;
		 UNLONG		m_unVinvbDcFilter_0;
		 UNLONG		m_unVinvcDcFilter_0;
		 
		INT16		m_i16SinQ0Ref_0;								//给定矢量角正弦值
		INT16		m_i16CosQ0Ref_0;								//给定矢量角余弦值
		INT16		m_i16SinQ0Ref1_0;								//给定矢量角正弦值
		INT16		m_i16CosQ0Ref1_0;								//给定矢量角余弦值
		
		INT16		m_i16CosQ120Ref_0;								
		INT16		m_i16CosQ240Ref_0;	    						
		                                    						
		UNLONG		m_unThetaRef_0;									//给定矢量角
		INT16		m_i16DthetaRefInst_0;							//给定矢量角瞬时步长
		                                    								

        INT16		m_i16FreqSetMax_0;
	    INT16		m_i16FreqSetMin_0;   
	   
	    INT16		m_i16wUirD_0;									//电流调节d轴输出量
		INT16		m_i16wUirQ_0;									//电流调节q轴输出量
		INT16		m_i16wUirZ_0;									//电流调节z轴输出量				

		INT16		m_i16wKRptConLmt_0;								//不同机型采用不同的重复控制系数	    		                                    						
		INT16		m_i16wIaDCRegOut_0;								//A相逆变电流直流分量调节，调节输出
		INT16		m_i16wIbDCRegOut_0;								//A相逆变电流直流分量调节，调节输出
		INT16		m_i16wIcDCRegOut_0;								//A相逆变电流直流分量调节，调节输出

	 	INT16		m_i16DthetaLBSBase_0;							//LBS频率对应的角度开关周期增量
		UNLONG		m_unDthetaLBSBaseFlt_0;							//LBS频率对应的角度开关周期增量的滤波值
		INT16		Theta;
	private:

		UNLONG		m_unPFoutaFilter_0;
		UNLONG		m_unPFoutbFilter_0;
		UNLONG		m_unPFoutcFilter_0;
		INT16		m_i16KpVolt_0;          						
		INT16		m_i16KpVoltDyn_0;								//电压环动态比例系数
		INT16		m_i16KiVolt_0;		    						
		INT16		m_i16KpCurr_0;	
		INT16		m_i16invKM_CNT_0;        			//有差并机						
		
//		INT16		m_i16DeadCmpnLmt_0;								//死区补偿限幅				                            								
		
		INT16		m_i161DivVbusP_0;								//4096*4050/VbusP
		INT16		m_i161DivVbusN_0;								//4096*4050/VbusN
		INT16		m_i16VaAct_0;
		INT16		m_i16VbAct_0;
		INT16		m_i16VcAct_0;
		
		
		INT16		m_i16Iaref_0;
		INT16		m_i16Ibref_0;
		INT16		m_i16Icref_0;
		
		UNLONG		unIarefFilter_0;
		UNLONG		unIbrefFilter_0;
		UNLONG		unIcrefFilter_0;
		
		INT16		m_i16PWMaDeadCmp_0;
		INT16		m_i16PWMbDeadCmp_0;
		INT16		m_i16PWMcDeadCmp_0;
													
		INT16		m_i16Zc_0;				
		INT16		m_i16Zl_0;	
	
		UNLONG		m_unIntgDShare_0;								//有差并机d轴积分
		UNLONG		m_unIcirFilter_0;								//d轴环流滤波
/****************************************电压环调节变量****************************************************/		
		
					
		UNLONG		m_unIntgDVr_0;									//电压调节d轴积分量
		UNLONG		m_unIntgQVr_0;									//电压调节q轴积分量
	    UNLONG      m_unIntgZVr_0;                               					   //电压调节z轴积分量
	    
/****************************************均流调节变量******************************************************************/	    		    	                        								
		INT16		m_i16VshareMd_0;								//均流d轴调节量   
		INT16		m_i16VshareMz_0;								//均流z轴调节量   
		UNLONG		m_unVshareMdFilt_0;                                               
		UNLONG		m_unVshareMdFilt2_0;
		UNLONG		m_unVshareMzFilt_0;                                               
		UNLONG		m_unVshareMzFilt2_0;
						
		INT16		m_i16IinvMdCir_0;								//D轴环流
		INT16		m_i16IinvMqCir_0;								//Q轴环流
		INT16		m_i16IinvMzCir_0;								//Z轴环流

		INT16		m_i16KPZ_0;									//Z轴环流调节P系数
		INT16		m_i16KIZ_0;										//Z轴环流调节I系数
		
		INT16		m_i16IDropVref_0;								//Id-Iq
		INT16		m_i16IDropTheta_0;								//Id+Iq
		INT16		m_i16IavgVref_0;								//IdAvg-IqAvg
		INT16		m_i16IavgTheta_0;								//IdAvg+IqAvg
		INT16		m_i16IcirVref_0;								//IdCir-IqCir
		INT16		m_i16IcirTheta_0;								//IdCir+IqCir

		
		INT16		m_i16KVrefDroop_0;								//D轴电压下垂系数
		INT16		m_i16KVrefCmpn_0;								//D轴电压补偿系数
		INT16		m_i16KPVref_0;									//D轴调节P系数
		INT16		m_i16KIVref_0;									//D轴调节I系数
                               								
		INT16		m_i16KThetaDroop_0;								//Q轴角度下垂系数
		INT16		m_i16KThetaCmpn_0;								//Q轴角度补偿系数
		INT16		m_i16KPTheta_0;									//Q轴调节P系数
		INT16		m_i16KITheta_0;									//Q轴调节I系数
    	                        								
		INT16		m_i16KPIabcDC_0;								//输出直流环流调节P系数
		INT16		m_i16KIIabcDC_0;								//输出直流环流调节I系数
    	                  								
		INT16		m_i16VrefDroop_0;								// 调节幅值，下垂量
		INT16		m_i16VrefCmpn_0;								// 调节幅值，补偿量
		INT16		m_i16VrefPRegout_0;								// 调节幅值，P调节输出
		UNLONG		m_unVrefIRegOut_0;								// 调节幅值，I调节输出
    	                            								
		INT16		m_i16ThetaDroop_0;								// 角度幅值，下垂量
		INT16		m_i16ThetaPRegout_0;							// 角度幅值，P调节输出
		UNLONG		m_unThetaIRegOut_0;								// 角度幅值，I调节输出
		INT16		m_i16ThetaIcirChg_0;							// 角度幅值，调节输出          
		UNLONG		m_unThetaIcirChgFlt_0;							// 角度幅值，调节输出的滤波值  
		
		UNLONG		m_unCirZIRegOut_0;								//Z轴环流调节，I调节输出
		INT16		m_i16CirPRegout_0;								//Z轴环流调节，P调节输出
	

/*****************************************电流环调节变量******************************************************/				
		INT16		m_i16IrefMd_0;									//电流给定矢量d轴分量
		INT16		m_i16IrefMq_0;									//电流给定矢量q轴分量
		INT16		m_i16IrefMz_0;									//电流给定矢量z轴分量
		INT16		m_i16IrefLimit_0;
		
		INT16		m_i16KRptCon_0;         						
					
		UINT16		m_u16T1Period_0;		
		UINT16		m_u16T4Period_0;								//载波周期
		INT16		m_i16NumCarrier_0;	
		
		INT16		m_i16DthetaIcirChg_0;
		
/**************************************重复控制变量**********************************************/	
		INT16		m_i16VerrMd_0;			
		INT16		m_i16VerrMq_0;
		INT16		m_i16VerrMz_0;
		UNLONG		m_unVerrMdFilt_0;			
		UNLONG		m_unVerrMqFilt_0;
		UNLONG		m_unVerrMzFilt_0;
		
		
		INT16		m_i16RptSite_0;									//重复控制调用上一个工频周期同相位补偿量		
		INT16		m_i16RptSiteSav_0;								//重复控制中存储的补偿量
		INT16		m_i16RptCmpnD_0;		
		INT16		m_i16RptCmpnQ_0;		
		INT16		m_i16RptCmpnZ_0;
		
		UNLONG		m_unRptTemp_0;
		UNLONG		m_unPointcntInvMF_0;
		UNLONG		m_unPointcntInvMFLF_0;							//重复控制点数尾数滤波	
		INT16		m_i16RptClearCnt_0;								//逆变软起时用该变量为重复控制数组初始化
/******************************************锁相调节变量*************************************************/		
		UNLONG		m_unDthetaRefStd_0;								//给定矢量角标准步长
		
		INT16		m_i16DphaseInst_0;								//跟踪瞬时相差
		UNLONG	m_unDphaseFilter_0;								//跟踪瞬时相差的滤波值
		INT16		m_i16CosDphase_0;								//锁相相差余弦值
		UNLONG		m_unDphaseMean_0;								//平均跟踪相差
		UNLONG		m_unDphaseBPMean_0;								//平均跟踪相差(BP-INV)
		INT16		m_i16CosDphaseBP_0;								//锁相相差余弦值(BP-INV)	
		INT16		m_i16DphaseBPInst_0;							//跟踪瞬时相差(BP-INV)

		INT16		m_i16DphaseLBSSync_0;							//角度差
		INT16		m_i16PLL1DthetaInstOneInt_0;
/***************************工频同步信号变量****************************************************/		                                                                                                                                                                                                         
		INT16		m_i16Theta0Timer6Cnt_0;							//角度0°时Timer6的计数值                                                                                                                                                   
		INT16		m_i16Theta180Timer6Cnt_0;						//角度180°时Timer6的计数值                                                                                                                                                 
		UINT32		m_u32TInvSyncClk_0;								//工频同步过零捕获值                                                                                                                                                        
		UINT32		m_u32TInvSyncClkOld_0;							//工频同步过零捕获值,前一拍的值                                                                                                                                             
		UINT32		m_u32TInvSyncPLL2Clk_0;							//工频同步锁相后角度过零点对应的CAP4的计数值                                                                                                                                
		UINT32		m_u32TInvSyncPLL2ClkOld_0;						//工频同步锁相后角度过零点对应的CAP4的计数值,前一拍的值                                                                                                                     
		INT16			m_i16PLL2CroseZeroFlag_0;							//PLL2过零标志标志
		INT32		m_i32TInvSync_0;								//工频同步捕获的周期值                                                                                                                                                      
		INT16		m_i16DphaseInvSync_0;							//工频同步锁相角度差                                                                                                                                                        
//		UNLONG		lDthetaSyncPLL_0;								//工频同步锁相角度调节积分量                                                                                                                                                
		INT16		m_i16DthetaInvSyncBase_0;						//工频同步频率对应的角度开关周期增量                                                                                                                                        
		UNLONG		m_unPLL1DthetaRefStd_0;							//工频同步锁频后角度开关周期增量                                                                                                                                            
		INT16		m_i16PLL1DthetaRefInst_0;						//工频同步锁相后角度开关周期增量                                                                                                                                            
		UNLONG		m_unPLL1ThetaRef_0;								//工频同步锁相后角度                                                                                                                                                        
		UNLONG		m_unPLL1ThetaRefOld_0;							//工频同步锁相后角度,前一拍的值                                                                                                                                             
		INT16		m_i16DthetaRefInstOneInt_0;					//工频同步锁相每个开关周期的增量
		INT16		m_i16DthetaRefInstRem_0;						//工频同步锁相调节量平分到每个开关周期的余数
		INT16		m_i16DthetaRefInstCnt_0;						//工频同步锁相在计算每个开关周期的增量时的计数值
		UNLONG		m_unThetaRefOld_0;								//PLL2锁相后角度,前一拍的值                                                                                                                                                 
		UINT16		m_u16InvSyncCnt_0;                                                                                                                                                                                                 
		UNLONG  	m_unThetaRef2_0;                                                                                                                                                                                                                                                                                                                                                                               

		INT16		m_i16CAPSyncFlag_0;
		//INT16		m_i16ThetaStepBp_0;	    						                         
		UNLONG		m_unDthetaBpPLL_0;								//锁相调节输出频率       
		INT16		m_i16DthetaBpPLLLmt_0;							//锁相调节输出频率限幅	                                                    
                                  								
		INT16		m_i16FlagIlCom_0;								//电感共模电流调节标志
		INT16		m_i16TraceBpflag_0;								//0逆变旁路频率大于0.2Hz,不进行锁相	
																	//1逆变旁路频率小于0.1Hz,进行锁相
										    						
		INT16		m_i16BpPhaseLockCnt_0;							//主机相位锁定计数器
		INT16		m_i16SlaverPhaseLock_0;							//从机相位锁定标志
		
		INT16		m_i16PulseOffCount;								//逆变器发波变量复位延时计数器										
		
		UINT32	m_u32ECap4RegsTSCTR_0;					//进中断时记录ECap4Regs.TSCTR 		
		INT16		m_i16EPwm6RegsTBCTR_0;					//进中断时记录Pwm6Regs.TBCTR	

/********************Adapter20K 记录逆变过零点*********************************************/		
		UINT32		m_u32VpwmCrossZeroClk_0;					//逆变过零时CPU Timer0的计数值
		UINT32		m_u32VpwmCrossZeroClkOld_0;					//逆变过零时CPU Timer0的计数值
		UINT32		m_u32Tpwm_0;
		INT32		m_i32DDPhaseInst_0;
		INT16		m_i16TinvUsSum_0;
		INT16		m_i16WaitingZeroCrossCnt_0;

		INT16	 	m_i16IlaFilterAvg_0;
		INT16		m_i16IlbFilterAvg_0;
		INT16		m_i16IlcFilterAvg_0;
		INT16		m_i16IlaFilterCir_0;
		INT16		m_i16IlbFilterCir_0;
		INT16		m_i16IlcFilterCir_0;
		INT16		m_i16IlaFilterShare_0;
		INT16		m_i16IlbFilterShare_0;
		INT16		m_i16IlcFilterShare_0;
		UNLONG		m_unIntgIlaFilter_0;
		UNLONG		m_unIntgIlbFilter_0;
		UNLONG		m_unIntgIlcFilter_0;
		INT16		m_i16IlaRegOut_0;
		INT16		m_i16IlbRegOut_0;
		INT16		m_i16IlcRegOut_0;
	

		INT16		m_i16IlaPAvg_0;
		INT16		m_i16IlaQAvg_0;
		INT16		m_i16IlbPAvg_0;
		INT16		m_i16IlbQAvg_0;
		INT16		m_i16IlcPAvg_0;
		INT16		m_i16IlcQAvg_0;
		INT16		m_i16IdAvg_0;

		INT16		m_i16IlaPShare_0;
		INT16		m_i16IlaQShare_0;
		INT16		m_i16IlbPShare_0;
		INT16		m_i16IlbQShare_0;
		INT16		m_i16IlcPShare_0;
		INT16		m_i16IlcQShare_0;

		INT16		m_i16IlaPShareReg_0;
		INT16		m_i16IlaQShareReg_0;
		INT16		m_i16IlbPShareReg_0;
		INT16		m_i16IlbQShareReg_0;
		INT16		m_i16IlcPShareReg_0;
		INT16		m_i16IlcQShareReg_0;

		INT16		m_i16KpACShare;
		INT16		m_i16KiACShare;

		INT16		m_i16CosQ0RefBak_0;
		INT16		m_i16SinQ0RefBak_0;

		UNLONG		m_unIntgIlaPReg_0;
		UNLONG		m_unIntgIlaQReg_0;
		UNLONG		m_unIntgIlbPReg_0;
		UNLONG		m_unIntgIlbQReg_0;
		UNLONG		m_unIntgIlcPReg_0;
		UNLONG		m_unIntgIlcQReg_0;

		INT16		m_i16VshareMq_0;
		INT16		m_i16IntgClrFlag_0;
		INT16		m_i16IntgClrDelayCnt_0;
		UNLONG		m_unIntgIinvdReg_0;
		
	public:	
		void 	App_InvAlgVarInit(void);
		void		App_InvAlgParamConfig(void);
		
		inline	void		Alg_Int_MainInterfaceVar(void);
			
		void 	Alg_Int_CarrierSync(void);							
		
		void 	Alg_Int_CurrShareReg(void);	
		void 	Alg_Int_PhaseLock(void);
		void 	Alg_Int_VoltReg(void);
		void		Alg_Int_VoltDCReg(void);
		void 	Alg_Int_CurrReg(void);
		void 	Alg_Int_RptCtrl(void);
		void 	Alg_Int_SPWM(void); 
		void		Alg_Int_InvSyncPulseGen(void);
		void		Alg_Int_InvSyncPulseRec(void);
		void	Alg_Int_InvSyncRecord(void);
		void 	Alg_Int_InvOffReset(void);
		
		inline	void		Alg_Int_MasterComm(void);
		
		void		Alg_Int_LockStatus(void);
		void	 Alg_ILFilterReg(void);
		void	Alg_InvACShareReg(void);
	
		friend	class	Class_Debug;								
		friend	class	Class_FaultRecord;	
		friend	class	Class_PowCANScheduler;
		friend  class	Class_Inverter;

	};


//正弦表
const	INT16 sintab[361]=
{
	0,71,143,214,286,357,428,499,570,641,                           
	711,782,852,921,991,1060,1129,1198,1266,1334,               	
	1401,1468,1534,1600,1666,1731,1796,1860,1923,1986,          
	2048,2110,2171,2231,2290,2349,2408,2465,2522,2578,          
	2633,2687,2741,2793,2845,2896,2946,2996,3044,3091,          
	3138,3183,3228,3271,3314,3355,3396,3435,3474,3511,          
	3547,3582,3617,3650,3681,3712,3742,3770,3798,3824,          
	3849,3873,3896,3917,3937,3956,3974,3991,4006,4021,          
	4034,4046,4056,4065,4074,4080,4086,4090,4094,4095,          
	4096,4095,4094,4090,4086,4080,4074,4065,4056,4046,          
	4034,4021,4006,3991,3974,3956,3937,3917,3896,3873,          
	3849,3824,3798,3770,3742,3712,3681,3650,3617,3582,          
	3547,3511,3474,3435,3396,3355,3314,3271,3228,3183,          
	3138,3091,3044,2996,2946,2896,2845,2793,2741,2687,          
	2633,2578,2522,2465,2408,2349,2290,2231,2171,2110,          
	2048,1986,1923,1860,1796,1731,1666,1600,1534,1468,          
	1401,1334,1266,1198,1129,1060,991,921,852,782,             
	711,641,570,499,428,357,286,214,143,71,                     
	0,-71,-143,-214,-286,-357,-428,-499,-570,-641,              
	-711,-782,-852,-921,-991,-1060,-1129,-1198,-1266,-1334,     
	-1401,-1468,-1534,-1600,-1666,-1731,-1796,-1860,-1923,-1986,
	-2048,-2110,-2171,-2231,-2290,-2349,-2408,-2465,-2522,-2578,
	-2633,-2687,-2741,-2793,-2845,-2896,-2946,-2996,-3044,-3091,
	-3138,-3183,-3228,-3271,-3314,-3355,-3396,-3435,-3474,-3511,
	-3547,-3582,-3617,-3650,-3681,-3712,-3742,-3770,-3798,-3824,
	-3849,-3873,-3896,-3917,-3937,-3956,-3974,-3991,-4006,-4021,
	-4034,-4046,-4056,-4065,-4074,-4080,-4086,-4090,-4094,-4095,
	-4096,-4095,-4094,-4090,-4086,-4080,-4074,-4065,-4056,-4046,
	-4034,-4021,-4006,-3991,-3974,-3956,-3937,-3917,-3896,-3873,
	-3849,-3824,-3798,-3770,-3742,-3712,-3681,-3650,-3617,-3582,
	-3547,-3511,-3474,-3435,-3396,-3355,-3314,-3271,-3228,-3183,
	-3138,-3091,-3044,-2996,-2946,-2896,-2845,-2793,-2741,-2687,
	-2633,-2578,-2522,-2465,-2408,-2349,-2290,-2231,-2171,-2110,
	-2048,-1986,-1923,-1860,-1796,-1731,-1666,-1600,-1534,-1468,
	-1401,-1334,-1266,-1198,-1129,-1060,-991,-921,-852,-782,   
	-711,-641,-570,-499,-428,-357,-286,-214,-143,-71,0 
};
const INT16 iVbusInvTab[2000]=
									//功能　　　		4096*4096/(Vbus定标后的值 405V＝4096)
									//母线电压倒数表	输入参数[3000-3000,4999-3000]
{
		5592,	5591,	5589,	5587,	5585,	5583,	5581,	5579,	5578,	5576,
		5574,	5572,	5570,	5568,	5566,	5565,	5563,	5561,	5559,	5557,
		5555,	5554,	5552,	5550,	5548,	5546,	5544,	5543,	5541,	5539,
		5537,	5535,	5533,	5532,	5530,	5528,	5526,	5524,	5522,	5521,
		5519,	5517,	5515,	5513,	5512,	5510,	5508,	5506,	5504,	5503,
		5501,	5499,	5497,	5495,	5494,	5492,	5490,	5488,	5486,	5485,
		5483,	5481,	5479,	5477,	5476,	5474,	5472,	5470,	5468,	5467,
		5465,	5463,	5461,	5460,	5458,	5456,	5454,	5452,	5451,	5449,
		5447,	5445,	5444,	5442,	5440,	5438,	5437,	5435,	5433,	5431,
		5430,	5428,	5426,	5424,	5423,	5421,	5419,	5417,	5415,	5414,
		5412,	5410,	5409,	5407,	5405,	5403,	5402,	5400,	5398,	5396,
		5395,	5393,	5391,	5389,	5388,	5386,	5384,	5382,	5381,	5379,
		5377,	5376,	5374,	5372,	5370,	5369,	5367,	5365,	5364,	5362,
		5360,	5358,	5357,	5355,	5353,	5352,	5350,	5348,	5346,	5345,
		5343,	5341,	5340,	5338,	5336,	5335,	5333,	5331,	5329,	5328,
		5326,	5324,	5323,	5321,	5319,	5318,	5316,	5314,	5313,	5311,
		5309,	5308,	5306,	5304,	5303,	5301,	5299,	5298,	5296,	5294,
		5292,	5291,	5289,	5287,	5286,	5284,	5282,	5281,	5279,	5278,
		5276,	5274,	5273,	5271,	5269,	5268,	5266,	5264,	5263,	5261,
		5259,	5258,	5256,	5254,	5253,	5251,	5249,	5248,	5246,	5245,
		5243,	5241,	5240,	5238,	5236,	5235,	5233,	5231,	5230,	5228,
		5227,	5225,	5223,	5222,	5220,	5218,	5217,	5215,	5214,	5212,
		5210,	5209,	5207,	5205,	5204,	5202,	5201,	5199,	5197,	5196,
		5194,	5193,	5191,	5189,	5188,	5186,	5185,	5183,	5181,	5180,
		5178,	5177,	5175,	5173,	5172,	5170,	5169,	5167,	5165,	5164,
		5162,	5161,	5159,	5157,	5156,	5154,	5153,	5151,	5150,	5148,
		5146,	5145,	5143,	5142,	5140,	5139,	5137,	5135,	5134,	5132,
		5131,	5129,	5128,	5126,	5124,	5123,	5121,	5120,	5118,	5117,
		5115,	5113,	5112,	5110,	5109,	5107,	5106,	5104,	5103,	5101,
		5099,	5098,	5096,	5095,	5093,	5092,	5090,	5089,	5087,	5086,
		5084,	5082,	5081,	5079,	5078,	5076,	5075,	5073,	5072,	5070,
		5069,	5067,	5066,	5064,	5063,	5061,	5059,	5058,	5056,	5055,
		5053,	5052,	5050,	5049,	5047,	5046,	5044,	5043,	5041,	5040,
		5038,	5037,	5035,	5034,	5032,	5031,	5029,	5028,	5026,	5025,
		5023,	5022,	5020,	5019,	5017,	5016,	5014,	5013,	5011,	5010,
		5008,	5007,	5005,	5004,	5002,	5001,	4999,	4998,	4996,	4995,
		4993,	4992,	4990,	4989,	4987,	4986,	4984,	4983,	4981,	4980,
		4978,	4977,	4975,	4974,	4973,	4971,	4970,	4968,	4967,	4965,
		4964,	4962,	4961,	4959,	4958,	4956,	4955,	4953,	4952,	4950,
		4949,	4948,	4946,	4945,	4943,	4942,	4940,	4939,	4937,	4936,
		4934,	4933,	4932,	4930,	4929,	4927,	4926,	4924,	4923,	4921,
		4920,	4919,	4917,	4916,	4914,	4913,	4911,	4910,	4908,	4907,
		4906,	4904,	4903,	4901,	4900,	4898,	4897,	4896,	4894,	4893,
		4891,	4890,	4888,	4887,	4886,	4884,	4883,	4881,	4880,	4879,
		4877,	4876,	4874,	4873,	4871,	4870,	4869,	4867,	4866,	4864,
		4863,	4862,	4860,	4859,	4857,	4856,	4855,	4853,	4852,	4850,
		4849,	4848,	4846,	4845,	4843,	4842,	4841,	4839,	4838,	4836,
		4835,	4834,	4832,	4831,	4829,	4828,	4827,	4825,	4824,	4822,
		4821,	4820,	4818,	4817,	4816,	4814,	4813,	4811,	4810,	4809,
		4807,	4806,	4804,	4803,	4802,	4800,	4799,	4798,	4796,	4795,
		4793,	4792,	4791,	4789,	4788,	4787,	4785,	4784,	4783,	4781,
		4780,	4778,	4777,	4776,	4774,	4773,	4772,	4770,	4769,	4768,
		4766,	4765,	4764,	4762,	4761,	4759,	4758,	4757,	4755,	4754,
		4753,	4751,	4750,	4749,	4747,	4746,	4745,	4743,	4742,	4741,
		4739,	4738,	4737,	4735,	4734,	4733,	4731,	4730,	4729,	4727,
		4726,	4725,	4723,	4722,	4721,	4719,	4718,	4717,	4715,	4714,
		4713,	4711,	4710,	4709,	4707,	4706,	4705,	4703,	4702,	4701,
		4700,	4698,	4697,	4696,	4694,	4693,	4692,	4690,	4689,	4688,
		4686,	4685,	4684,	4682,	4681,	4680,	4679,	4677,	4676,	4675,
		4673,	4672,	4671,	4669,	4668,	4667,	4666,	4664,	4663,	4662,
		4660,	4659,	4658,	4656,	4655,	4654,	4653,	4651,	4650,	4649,
		4647,	4646,	4645,	4644,	4642,	4641,	4640,	4638,	4637,	4636,
		4635,	4633,	4632,	4631,	4629,	4628,	4627,	4626,	4624,	4623,
		4622,	4621,	4619,	4618,	4617,	4615,	4614,	4613,	4612,	4610,
		4609,	4608,	4607,	4605,	4604,	4603,	4602,	4600,	4599,	4598,
		4596,	4595,	4594,	4593,	4591,	4590,	4589,	4588,	4586,	4585,
		4584,	4583,	4581,	4580,	4579,	4578,	4576,	4575,	4574,	4573,
		4571,	4570,	4569,	4568,	4566,	4565,	4564,	4563,	4562,	4560,
		4559,	4558,	4557,	4555,	4554,	4553,	4552,	4550,	4549,	4548,
		4547,	4545,	4544,	4543,	4542,	4541,	4539,	4538,	4537,	4536,
		4534,	4533,	4532,	4531,	4529,	4528,	4527,	4526,	4525,	4523,
		4522,	4521,	4520,	4519,	4517,	4516,	4515,	4514,	4512,	4511,
		4510,	4509,	4508,	4506,	4505,	4504,	4503,	4502,	4500,	4499,
		4498,	4497,	4496,	4494,	4493,	4492,	4491,	4489,	4488,	4487,
		4486,	4485,	4483,	4482,	4481,	4480,	4479,	4478,	4476,	4475,
		4474,	4473,	4472,	4470,	4469,	4468,	4467,	4466,	4464,	4463,
		4462,	4461,	4460,	4458,	4457,	4456,	4455,	4454,	4453,	4451,
		4450,	4449,	4448,	4447,	4445,	4444,	4443,	4442,	4441,	4440,
		4438,	4437,	4436,	4435,	4434,	4433,	4431,	4430,	4429,	4428,
		4427,	4426,	4424,	4423,	4422,	4421,	4420,	4419,	4417,	4416,
		4415,	4414,	4413,	4412,	4410,	4409,	4408,	4407,	4406,	4405,
		4403,	4402,	4401,	4400,	4399,	4398,	4397,	4395,	4394,	4393,
		4392,	4391,	4390,	4388,	4387,	4386,	4385,	4384,	4383,	4382,
		4380,	4379,	4378,	4377,	4376,	4375,	4374,	4372,	4371,	4370,
		4369,	4368,	4367,	4366,	4365,	4363,	4362,	4361,	4360,	4359,
		4358,	4357,	4355,	4354,	4353,	4352,	4351,	4350,	4349,	4348,
		4346,	4345,	4344,	4343,	4342,	4341,	4340,	4339,	4337,	4336,
		4335,	4334,	4333,	4332,	4331,	4330,	4328,	4327,	4326,	4325,
		4324,	4323,	4322,	4321,	4320,	4318,	4317,	4316,	4315,	4314,
		4313,	4312,	4311,	4310,	4308,	4307,	4306,	4305,	4304,	4303,
		4302,	4301,	4300,	4299,	4297,	4296,	4295,	4294,	4293,	4292,
		4291,	4290,	4289,	4288,	4286,	4285,	4284,	4283,	4282,	4281,
		4280,	4279,	4278,	4277,	4276,	4274,	4273,	4272,	4271,	4270,
		4269,	4268,	4267,	4266,	4265,	4264,	4263,	4261,	4260,	4259,
		4258,	4257,	4256,	4255,	4254,	4253,	4252,	4251,	4250,	4248,
		4247,	4246,	4245,	4244,	4243,	4242,	4241,	4240,	4239,	4238,
		4237,	4236,	4235,	4233,	4232,	4231,	4230,	4229,	4228,	4227,
		4226,	4225,	4224,	4223,	4222,	4221,	4220,	4219,	4218,	4216,
		4215,	4214,	4213,	4212,	4211,	4210,	4209,	4208,	4207,	4206,
		4205,	4204,	4203,	4202,	4201,	4200,	4199,	4197,	4196,	4195,
		4194,	4193,	4192,	4191,	4190,	4189,	4188,	4187,	4186,	4185,
		4184,	4183,	4182,	4181,	4180,	4179,	4178,	4177,	4176,	4174,
		4173,	4172,	4171,	4170,	4169,	4168,	4167,	4166,	4165,	4164,
		4163,	4162,	4161,	4160,	4159,	4158,	4157,	4156,	4155,	4154,
		4153,	4152,	4151,	4150,	4149,	4148,	4147,	4146,	4145,	4144,
		4143,	4141,	4140,	4139,	4138,	4137,	4136,	4135,	4134,	4133,
		4132,	4131,	4130,	4129,	4128,	4127,	4126,	4125,	4124,	4123,
		4122,	4121,	4120,	4119,	4118,	4117,	4116,	4115,	4114,	4113,
		4112,	4111,	4110,	4109,	4108,	4107,	4106,	4105,	4104,	4103,
		4102,	4101,	4100,	4099,	4098,	4097,	4096,	4095,	4094,	4093,
		4092,	4091,	4090,	4089,	4088,	4087,	4086,	4085,	4084,	4083,
		4082,	4081,	4080,	4079,	4078,	4077,	4076,	4075,	4074,	4073,
		4072,	4071,	4070,	4069,	4068,	4067,	4066,	4065,	4064,	4063,
		4062,	4061,	4060,	4059,	4058,	4057,	4056,	4055,	4054,	4053,
		4052,	4051,	4051,	4050,	4049,	4048,	4047,	4046,	4045,	4044,
		4043,	4042,	4041,	4040,	4039,	4038,	4037,	4036,	4035,	4034,
		4033,	4032,	4031,	4030,	4029,	4028,	4027,	4026,	4025,	4024,
		4023,	4022,	4021,	4020,	4019,	4018,	4018,	4017,	4016,	4015,
		4014,	4013,	4012,	4011,	4010,	4009,	4008,	4007,	4006,	4005,
		4004,	4003,	4002,	4001,	4000,	3999,	3998,	3997,	3996,	3996,
		3995,	3994,	3993,	3992,	3991,	3990,	3989,	3988,	3987,	3986,
		3985,	3984,	3983,	3982,	3981,	3980,	3979,	3978,	3978,	3977,
		3976,	3975,	3974,	3973,	3972,	3971,	3970,	3969,	3968,	3967,
		3966,	3965,	3964,	3963,	3962,	3962,	3961,	3960,	3959,	3958,
		3957,	3956,	3955,	3954,	3953,	3952,	3951,	3950,	3949,	3949,
		3948,	3947,	3946,	3945,	3944,	3943,	3942,	3941,	3940,	3939,
		3938,	3937,	3936,	3936,	3935,	3934,	3933,	3932,	3931,	3930,
		3929,	3928,	3927,	3926,	3925,	3924,	3924,	3923,	3922,	3921,
		3920,	3919,	3918,	3917,	3916,	3915,	3914,	3914,	3913,	3912,
		3911,	3910,	3909,	3908,	3907,	3906,	3905,	3904,	3903,	3903,
		3902,	3901,	3900,	3899,	3898,	3897,	3896,	3895,	3894,	3894,
		3893,	3892,	3891,	3890,	3889,	3888,	3887,	3886,	3885,	3885,
		3884,	3883,	3882,	3881,	3880,	3879,	3878,	3877,	3876,	3876,
		3875,	3874,	3873,	3872,	3871,	3870,	3869,	3868,	3868,	3867,
		3866,	3865,	3864,	3863,	3862,	3861,	3860,	3859,	3859,	3858,
		3857,	3856,	3855,	3854,	3853,	3852,	3852,	3851,	3850,	3849,
		3848,	3847,	3846,	3845,	3844,	3844,	3843,	3842,	3841,	3840,
		3839,	3838,	3837,	3837,	3836,	3835,	3834,	3833,	3832,	3831,
		3830,	3830,	3829,	3828,	3827,	3826,	3825,	3824,	3823,	3823,
		3822,	3821,	3820,	3819,	3818,	3817,	3816,	3816,	3815,	3814,
		3813,	3812,	3811,	3810,	3810,	3809,	3808,	3807,	3806,	3805,
		3804,	3803,	3803,	3802,	3801,	3800,	3799,	3798,	3797,	3797,
		3796,	3795,	3794,	3793,	3792,	3791,	3791,	3790,	3789,	3788,
		3787,	3786,	3785,	3785,	3784,	3783,	3782,	3781,	3780,	3780,
		3779,	3778,	3777,	3776,	3775,	3774,	3774,	3773,	3772,	3771,
		3770,	3769,	3768,	3768,	3767,	3766,	3765,	3764,	3763,	3763,
		3762,	3761,	3760,	3759,	3758,	3757,	3757,	3756,	3755,	3754,
		3753,	3752,	3752,	3751,	3750,	3749,	3748,	3747,	3747,	3746,
		3745,	3744,	3743,	3742,	3742,	3741,	3740,	3739,	3738,	3737,
		3737,	3736,	3735,	3734,	3733,	3732,	3732,	3731,	3730,	3729,
		3728,	3727,	3727,	3726,	3725,	3724,	3723,	3722,	3722,	3721,
		3720,	3719,	3718,	3718,	3717,	3716,	3715,	3714,	3713,	3713,
		3712,	3711,	3710,	3709,	3708,	3708,	3707,	3706,	3705,	3704,
		3704,	3703,	3702,	3701,	3700,	3699,	3699,	3698,	3697,	3696,
		3695,	3695,	3694,	3693,	3692,	3691,	3691,	3690,	3689,	3688,
		3687,	3686,	3686,	3685,	3684,	3683,	3682,	3682,	3681,	3680,
		3679,	3678,	3678,	3677,	3676,	3675,	3674,	3674,	3673,	3672,
		3671,	3670,	3670,	3669,	3668,	3667,	3666,	3666,	3665,	3664,
		3663,	3662,	3662,	3661,	3660,	3659,	3658,	3658,	3657,	3656,
		3655,	3654,	3654,	3653,	3652,	3651,	3650,	3650,	3649,	3648,
		3647,	3646,	3646,	3645,	3644,	3643,	3642,	3642,	3641,	3640,
		3639,	3639,	3638,	3637,	3636,	3635,	3635,	3634,	3633,	3632,
		3631,	3631,	3630,	3629,	3628,	3628,	3627,	3626,	3625,	3624,
		3624,	3623,	3622,	3621,	3620,	3620,	3619,	3618,	3617,	3617,
		3616,	3615,	3614,	3613,	3613,	3612,	3611,	3610,	3610,	3609,
		3608,	3607,	3606,	3606,	3605,	3604,	3603,	3603,	3602,	3601,
		3600,	3599,	3599,	3598,	3597,	3596,	3596,	3595,	3594,	3593,
		3593,	3592,	3591,	3590,	3589,	3589,	3588,	3587,	3586,	3586,
		3585,	3584,	3583,	3583,	3582,	3581,	3580,	3580,	3579,	3578,
		3577,	3576,	3576,	3575,	3574,	3573,	3573,	3572,	3571,	3570,
		3570,	3569,	3568,	3567,	3567,	3566,	3565,	3564,	3564,	3563,
		3562,	3561,	3561,	3560,	3559,	3558,	3558,	3557,	3556,	3555,
		3554,	3554,	3553,	3552,	3551,	3551,	3550,	3549,	3548,	3548,
		3547,	3546,	3545,	3545,	3544,	3543,	3542,	3542,	3541,	3540,
		3539,	3539,	3538,	3537,	3537,	3536,	3535,	3534,	3534,	3533,
		3532,	3531,	3531,	3530,	3529,	3528,	3528,	3527,	3526,	3525,
		3525,	3524,	3523,	3522,	3522,	3521,	3520,	3519,	3519,	3518,
		3517,	3516,	3516,	3515,	3514,	3514,	3513,	3512,	3511,	3511,
		3510,	3509,	3508,	3508,	3507,	3506,	3505,	3505,	3504,	3503,
		3503,	3502,	3501,	3500,	3500,	3499,	3498,	3497,	3497,	3496,
		3495,	3495,	3494,	3493,	3492,	3492,	3491,	3490,	3489,	3489,
		3488,	3487,	3487,	3486,	3485,	3484,	3484,	3483,	3482,	3481,
		3481,	3480,	3479,	3479,	3478,	3477,	3476,	3476,	3475,	3474,
		3474,	3473,	3472,	3471,	3471,	3470,	3469,	3469,	3468,	3467,
		3466,	3466,	3465,	3464,	3464,	3463,	3462,	3461,	3461,	3460,
		3459,	3459,	3458,	3457,	3456,	3456,	3455,	3454,	3454,	3453,
		3452,	3451,	3451,	3450,	3449,	3449,	3448,	3447,	3446,	3446,
		3445,	3444,	3444,	3443,	3442,	3441,	3441,	3440,	3439,	3439,
		3438,	3437,	3437,	3436,	3435,	3434,	3434,	3433,	3432,	3432,
		3431,	3430,	3430,	3429,	3428,	3427,	3427,	3426,	3425,	3425,
		3424,	3423,	3423,	3422,	3421,	3420,	3420,	3419,	3418,	3418,
		3417,	3416,	3416,	3415,	3414,	3413,	3413,	3412,	3411,	3411,
		3410,	3409,	3409,	3408,	3407,	3407,	3406,	3405,	3404,	3404,
		3403,	3402,	3402,	3401,	3400,	3400,	3399,	3398,	3398,	3397,
		3396,	3396,	3395,	3394,	3393,	3393,	3392,	3391,	3391,	3390,
		3389,	3389,	3388,	3387,	3387,	3386,	3385,	3385,	3384,	3383,
		3383,	3382,	3381,	3380,	3380,	3379,	3378,	3378,	3377,	3376,
		3376,	3375,	3374,	3374,	3373,	3372,	3372,	3371,	3370,	3370,
		3369,	3368,	3368,	3367,	3366,	3366,	3365,	3364,	3364,	3363,
		3362,	3361,	3361,	3360,	3359,	3359,	3358,	3357,	3357,	3356
};
	INT16		i16RptIntD_0[K45HzPointCntCnst];				//重复控制占用空间
	INT16 		i16RptIntQ_0[K45HzPointCntCnst];
	INT16 		i16RptIntZ_0[K45HzPointCntCnst];
	INT16		i16TempIntAx_0;


#endif
//===========================================================================
// End of file.
//===========================================================================
